{
    "Diesel Engine Oil": {
        "description": "API CI-4/SL • SAE 15W-40, 20W-50 • ASTM D445, D92, D97, D1298, D892 Tested • IRI Certified\n\nPetronox Diesel Engine Oil is meticulously engineered to meet the demanding requirements of modern diesel engines across transportation, industrial, and power-generation sectors. Our formulation is built on 100% virgin base oils combined with an enhanced additive system that ensures superior stability, durability, and long-term engine protection.\n\nThis advanced diesel lubricant provides exceptional resistance to oxidation, sludge formation, thermal breakdown, and high-temperature stress, preserving optimal viscosity even during extended operation cycles. Whether powering long-haul trucks, commercial fleets, heavy machinery, or high-load electrical generators, Petronox Diesel Engine Oil guarantees consistent and dependable performance.\n\nDesigned for engines operating under severe conditions—such as high temperatures, dusty environments, and continuous heavy-duty use—it minimizes wear on metal components, protects against corrosion, and maintains engine cleanliness for longer intervals. The result is improved fuel efficiency, smoother engine operation, and reduced maintenance downtime.\n\nWith Petronox, every drop is engineered to extend engine life, maximize operational reliability, and deliver stable power output under the harshest working environments. It is the ideal choice for professionals who demand endurance, reliability, and uncompromising engine performance in every run."
    },
    "Motor Engine Oil (Gasoline)": {
        "description": "API SN/CF • SAE 5W-30, 10W-40, 20W-50 • ASTM Tested • IRI Certified\n\nPetronox Motor Engine Oil is specifically formulated to meet the advanced requirements of today's gasoline engines—engines that demand precision, efficiency, and unwavering protection. Built using high-quality virgin base oils and a state-of-the-art additive package, this oil delivers exceptional performance across all driving conditions.\n\nIts low-evaporation formula provides immediate protection during cold starts, minimizing metal-to-metal friction at the most critical moment of engine operation. Whether driving in urban stop-and-go traffic or at high speeds on the highway, Petronox maintains stable viscosity, ensuring smooth operation and consistent lubrication throughout the entire temperature range.\n\nThe advanced detergent system effectively reduces sludge, varnish, and deposits, keeping the engine clean and performing at peak efficiency for longer periods. This results in enhanced fuel economy, a more responsive throttle, and a driving experience that feels smoother and more powerful.\n\nPetronox Motor Engine Oil is the ideal choice for daily-use vehicles, high-performance engines, luxury cars, and modern vehicles designed for longevity and precision engineering. By reducing wear, minimizing friction, and maintaining internal engine purity, it extends engine life and ensures reliable performance mile after mile.\n\nEngineered for drivers who expect quiet operation, efficient performance, and long-lasting protection, Petronox sets a new standard in gasoline engine lubrication."
    },
    "Automotive Gear Oil": {
        "description": "API GL-5 • SAE 75W-90, 80W-90, 85W-140 • ASTM D445 Tested • IRI Certified\n\nPetronox Automotive Gear Oil is engineered to deliver uncompromising protection for transmissions, differentials, and gear systems operating under severe pressure and demanding mechanical stress. Using premium virgin base oils combined with advanced extreme-pressure (EP) additives, this formulation is built to withstand intense load, friction, and heat inside the gearbox, even during prolonged or aggressive driving conditions.\n\nIts fortified composition reduces metal-to-metal contact, preventing premature wear, pitting, and scuffing of gear surfaces. By maintaining stable viscosity and exceptional thermal resistance, Petronox Gear Oil ensures smoother gear transitions, minimizes noise, and helps prevent overheating—one of the primary causes of gearbox degradation.\n\nDesigned for manual transmissions, off-road vehicles, commercial fleets, industrial machinery, and heavy-duty drivetrains, it guarantees consistent power delivery and long-lasting gearbox reliability. The oil’s superior lubrication film enhances operational efficiency, protects internal components against corrosion, and extends service intervals, reducing maintenance costs and downtime.\n\nWhether for professionals relying on durable equipment or drivers seeking superior shifting performance, Petronox Automotive Gear Oil provides unmatched dependability and advanced protection across a wide range of demanding applications. It stands as the optimal solution for anyone who values endurance, mechanical stability, and maximum drivetrain performance."
    },
    "Hydraulic Oil": {
        "description": "ISO VG 32, 46, 68 • ASTM D445, D892, D1298 Tested • IRI Certified\n\nPetronox Hydraulic Oil is formulated to deliver exceptional performance in hydraulic systems operating under high pressure, heavy load, and continuous industrial use. Produced from top-grade virgin base oils and fortified with anti-wear and anti-foam additives, it ensures smooth and efficient hydraulic power transfer across a wide range of temperatures.\n\nThis oil provides outstanding protection against oxidation, corrosion, and fluid degradation, maintaining stable viscosity and optimal performance even in harsh environments such as construction sites, manufacturing plants, and agricultural machinery. Its excellent filterability helps prevent system clogging, ensuring reliable pump operation and extending the life of valves, cylinders, and hydraulic components.\n\nDesigned for excavators, loaders, forklifts, injection machines, and industrial hydraulic systems, Petronox Hydraulic Oil guarantees consistent pressure, reduced downtime, and long-lasting operational efficiency. When performance and durability matter, Petronox delivers uncompromising reliability."
    },
    "Automatic Transmission Fluid (ATF)": {
        "description": "Dexron III/Mercon • ASTM Tested • IRI Certified\n\nPetronox Automatic Transmission Fluid (ATF) is engineered to meet the rigorous demands of modern automatic and electronically controlled transmissions. Its advanced friction modifiers allow smooth, precise, and consistent gear shifts, reducing vibration and preventing shift shock during acceleration and deceleration.\n\nThe fluid’s enhanced thermal stability prevents oxidation and varnish buildup, helping transmission systems stay clean and responsive over extended service intervals. With excellent shear resistance and high viscosity stability, it ensures reliable lubrication, efficient power transfer, and superior protection of clutch plates, torque converters, and internal hydraulic controls.\n\nCompatible with a wide range of passenger vehicles, SUVs, and light commercial transmissions, Petronox ATF offers long-lasting performance, extended component life, and dependable operation under both daily driving and high-load conditions. It is the ideal choice for anyone seeking smooth shifting, lower heat generation, and maximum transmission longevity."
    },
    "2T and 4T Motorcycle Oil": {
        "description": "API SL/SJ • SAE 10W-40, 20W-50 • JASO MA/MA2 • IRI Certified\n\nPetronox 2T and 4T Motorcycle Oil is tailored to meet the specific lubrication needs of two-stroke and four-stroke motorcycle engines. Formulated with high-quality virgin base oils and a premium additive package, it delivers exceptional engine cleanliness, improved throttle response, and reliable performance across urban, off-road, and high-speed riding conditions.\n\nFor 2-stroke engines, it provides clean burning, reduced smoke, and superior protection against piston scuffing and spark plug fouling.\nFor 4-stroke engines, it offers stable viscosity, enhanced heat resistance, and minimized wear of the clutch and transmission components.\n\nDesigned for scooters, dirt bikes, street motorcycles, and ATVs, Petronox Motorcycle Oil delivers smooth acceleration, reduced engine noise, and maximum protection under extreme temperatures and varied terrains. Riders benefit from a cleaner engine, stronger performance, and longer engine life—no matter the ride."
    },
    "Marine Engine Oil": {
        "description": "API CF • SAE 30, 40, 15W-40 • ASTM Tested • IRI Certified\n\nPetronox Marine Engine Oil is specially formulated to meet the extreme demands of marine propulsion systems and auxiliary engines. Built using high-purity virgin base oils and a robust detergent–dispersant additive package, it delivers outstanding protection in environments where engines operate under continuous load, variable speeds, and harsh marine conditions.\n\nIts superior resistance to oxidation, corrosion, and water contamination ensures stable performance even in engines exposed to saltwater, humidity, and long operating hours. The enhanced cleaning additives prevent deposit buildup on pistons, liners, and turbochargers—maintaining optimal power output and fuel efficiency.\n\nDesigned for commercial vessels, fishing boats, cargo ships, and industrial marine equipment, Petronox Marine Engine Oil provides excellent control over wear, minimizes friction, and extends engine life significantly. Its strong neutralizing capacity protects against high-sulfur fuels commonly used in marine operations, ensuring reliable performance under heavy-duty cycles.\n\nWhen operating at sea, reliability is not optional—Petronox Marine Engine Oil delivers consistent power, long-term protection, and uncompromising durability for all marine engines."
    },
    "Brake Fluid": {
        "description": "DOT 3/DOT 4 • High Boiling Point • ASTM Tested • IRI Certified\n\nPetronox Brake Fluid is engineered to provide maximum safety, stability, and braking performance across a wide range of temperatures and driving conditions. Formulated with high-boiling-point components, it resists vapor lock and maintains firm, responsive braking even under intense heat generated during heavy braking or aggressive driving.\n\nIts advanced anti-corrosion additives protect the entire hydraulic braking system— including calipers, master cylinders, ABS units, and steel brake lines—ensuring long-term reliability and reduced maintenance requirements. The fluid’s low-viscosity performance supports modern braking technologies, offering precise control and smooth modulation.\n\nDesigned for passenger vehicles, SUVs, motorcycles, and light commercial fleets, Petronox Brake Fluid provides consistent pressure transfer, rapid braking response, and enhanced safety in both daily traffic and high-performance situations. It is thoroughly formulated to meet strict industry standards, ensuring stable performance regardless of climate or driving style.\n\nWith Petronox, every stop is reliable—delivering confidence, precision, and maximum braking efficiency when it matters most."
    },
    "Grease": {
        "description": "NLGI Grade 2/3 • Lithium/Lithium Complex • ASTM Tested • IRI Certified\n\nPetronox Grease is crafted to provide exceptional lubrication and long-lasting protection for bearings, joints, and high-load mechanical components. Produced using premium base oils and reinforced with advanced thickening agents, it offers outstanding resistance to water, heat, vibration, and mechanical stress.\n\nIts superior adhesion ensures the grease remains firmly in place, delivering a continuous lubricating film that reduces friction, minimizes wear, and prevents metal-to-metal contact. Petronox Grease also provides strong protection against rust, oxidation, and contamination—ensuring smooth, quiet operation in even the harshest environments.\n\nIdeal for automotive applications, industrial machinery, agricultural equipment, construction tools, and heavy-duty bearings, this grease ensures reliable performance and extended component life. Petronox Grease is built to withstand high pressure, severe impact loads, and demanding operational cycles."
    },
    "Industrial Gear Oil": {
        "description": "ISO VG 150, 220, 320, 460 • EP Additives • ASTM D445, D892 Tested • IRI Certified\n\nPetronox Industrial Gear Oil is engineered for the extreme demands of industrial gearboxes, large-scale machinery, and heavy-duty mechanical systems. Its advanced EP (Extreme Pressure) additives and high-performance virgin base oils provide exceptional protection against gear wear, scoring, and micropitting even under high loads and shock conditions.\n\nThis oil maintains superior thermal stability and oxidation resistance, ensuring consistent viscosity, reduced sludge formation, and extended lubricant life during prolonged industrial operations. Petronox Industrial Gear Oil also offers enhanced resistance to foaming and water separation, improving filtration efficiency and maintaining clean, smooth-running gear systems.\n\nUsed in factories, power plants, manufacturing facilities, mining equipment, and high-torque industrial units, it guarantees steady power transmission, lower operating temperatures, and maximum durability. Built for environments where downtime is not an option—Petronox delivers uncompromising reliability and performance."
    },
    "Compressor Oil": {
        "description": "ISO VG 32, 46, 68, 100 • Low Volatility • ASTM Tested • IRI Certified\n\nPetronox Compressor Oil is engineered to deliver exceptional lubrication and long-term protection for a wide range of air compressors, including rotary screw, reciprocating, and vane compressors. Formulated with high-purity virgin base oils and advanced oxidation inhibitors, it provides outstanding thermal stability and resistance to carbon buildup, ensuring clean and efficient compressor operation.\n\nIts low volatility minimizes oil carryover, reducing maintenance needs and extending filter life. Petronox Compressor Oil also offers excellent water separation capabilities, protecting internal components from moisture, rust, and corrosion—common threats in high-pressure compressor environments.\n\nWhether used in workshops, industrial plants, pneumatic systems, or heavy-duty construction sites, this oil guarantees smoother operation, reduced friction, quieter performance, and maximum compressor life. Built for continuous use and demanding conditions, Petronox ensures reliability where air power is critical."
    },
    "Turbine Oil": {
        "description": "ISO VG 32, 46, 68 • High Oxidative Stability • ASTM Tested • IRI Certified\n\nPetronox Turbine Oil is specially designed for steam, gas, and hydraulic turbines that operate under extreme temperatures, high rotational speeds, and continuous load. Its exceptional oxidative stability and sludge control technology prevent deposit formation, varnish buildup, and thermal degradation even during prolonged high-temperature operation.\n\nThe advanced anti-wear and anti-foam additives ensure consistent lubrication, optimal heat dissipation, and smooth turbine function. Petronox Turbine Oil provides excellent water separation and protects vital components from corrosion, ensuring uninterrupted performance in demanding industrial environments.\n\nPerfect for power generation stations, industrial turbines, marine turbines, and hydraulic turbines, this formulation delivers long service life, improved efficiency, and reliable protection. It is engineered for precision-driven systems where stability, cleanliness, and endurance are essential."
    },
    "Motor Flushing Oil": {
        "description": "High-Detergent Formula • Low Viscosity • Engine System Cleaner • IRI Certified\n\nPetronox Motor Flushing Oil is developed to deeply clean and restore engine systems by removing accumulated sludge, varnish, contaminants, and carbon deposits. Designed with a high-detergent, low-viscosity formula, it flows rapidly throughout the engine, dissolving impurities and carrying them out during the oil change process.\n\nUsing Petronox Flushing Oil before adding fresh lubricant ensures a cleaner, smoother, and more efficient engine operation. It helps free sticky piston rings, improves hydraulic lifter performance, and enhances oil circulation in older or heavily used engines. This results in reduced engine noise, improved compression, and restored fuel efficiency.\n\nIdeal for vehicles with irregular maintenance, high mileage, or engines showing signs of sludge buildup, Petronox Flushing Oil prepares the engine for maximum protection when fresh oil is added. It is a key step for achieving peak engine health and prolonging engine life."
    }
}
